# IS 362 - Project 3

Your assignment involves combining information from a number of SQL tables,
then displaying the information in a pandas DataFrame.
For your relational database management system, you may use any RDBMS,
including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by
the database in Step 1 below.
1. For your database, you should download and install the appropriate version
of the Chinook database for your RDBMS, which is available here, under the
downloads tab: https://chinookdatabase.codeplex.com/
2. Your task is to create a pandas DataFrame that displays Customers’ Last
Name and First Name, and each customer’s purchased Track names and
Album Titles. The information should be sorted by Customer LastName
then Customer FirstName.

In [12]:
import sqlite3
import pandas as pd

In [30]:
conn = sqlite3.connect(r'C:\Users\Jaizelle\Downloads\ChinookDatabase\sourceCode\chinookdatabase\ChinookDatabase\DataSources\Chinook_Sqlite.sqlite')
#tracks = pd.read_sql_query('Select * from Track', con=conn)


sql = '''SELECT a.LastName, a.FirstName, b.Name, c.Title
         FROM Customer a
         INNER JOIN Invoice d ON a.CustomerId = d.CustomerId
         INNER JOIN InvoiceLine e ON d.InvoiceId = e.InvoiceId
         INNER JOIN Track b ON e.TrackId = b.TrackId
         INNER JOIN Album c ON b.AlbumId = c.AlbumId
         ORDER BY a.LastName'''


df = pd.read_sql_query(sql, con=conn)
df.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas